docs/loans/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-02 Thu 22:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=1024, initial-scale=1" />
<title>Fortran Finance</title>
<meta name="author" content="Mitch Richling" />
<meta name="description" content="Documentation for loan examples in the Fortran Finance repository." />
<meta name="keywords" content="finance fortran monte carlo inflation cashflow time value of money tvm percentages taxes stock market" />
<meta name="generator" content="Org Mode" />














</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://richmit.github.io/FortranFinance/index.html"> UP </a>
 |
 <a accesskey="H" href="https://github.com/richmit/FortranFinance"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Fortran Finance
<br />
<span class="subtitle">Loan Amortization</span>
</h1>
<table border="2 solid #ccc" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right"><b>Author:</b></td>
<td class="org-left"><i>Mitch Richling</i></td>
</tr>

<tr>
<td class="org-right"><b>Updated:</b></td>
<td class="org-left"><i>2025-01-02 22:56:50</i></td>
</tr>

<tr>
<td class="org-right"><b>Generated:</b></td>
<td class="org-left"><i>2025-01-02 22:56:50</i></td>
</tr>
</tbody>
</table>
<p align="center">
Copyright &copy; 2025 Mitch Richling. All rights reserved.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org70c6c2c">1. <code>loan_level_payments.f90</code></a></li>
<li><a href="#org4e93b37">2. <code>loan_geometric_payments.f90</code></a></li>
<li><a href="#orgedcde21">3. <code>loan_up_down_payments.f90</code></a></li>
</ul>
</div>
</div>

<div id="outline-container-org70c6c2c" class="outline-2">
<h2 id="org70c6c2c"><span class="section-number-2">1.</span> <code>loan_level_payments.f90</code></h2>
<div class="outline-text-2" id="text-1">
<p>
The typical approach to solving loan problems is to equate the present value of the principal with the present value of the
payment cashflow stream in a single equation and solve for the payment.  With only one principal payment occurring at the
beginning and a payment stream consisting of a level annuity certain, this is pretty simple.  Unfortunately things get much
more complex if the payment structure (for principal or repayment) changes from this baseline.  These more difficult
situations can be easily handled by considering the problem as multiple cashflow streams.  In order to illustrate how to
approach such problems using a multiple cashflow methodology, this program applies the technique to solve the familiar
problem of the simple loan.
</p>

<p>
We can model a loan as a pair of parallel cashflows: 
</p>
<ul class="org-ul">
<li>Money paid by the lender (i.e. the principal) &#x2013; a negative cash flow from the lender's perspective</li>
<li>Money paid to the lender (i.e. loan payments) &#x2013; a positive cash flow from the lender's perspective</li>
</ul>
<p>
These two cash flows should have equal magnitude PV &amp; FV, but of opposite sign.
</p>
</div>
</div>

<div id="outline-container-org4e93b37" class="outline-2">
<h2 id="org4e93b37"><span class="section-number-2">2.</span> <code>loan_geometric_payments.f90</code></h2>
<div class="outline-text-2" id="text-2">
<p>
This program extends the example from loan_level_payments.f90 to geometric payments.  Not much changes in the flow except the
annuity type.
</p>

<p>
If you are curious about how such a loan might come about, then consider the following scenario:
</p>

<p>
A business needs a 1M load.  They wish to make annual payments, and to pay down the loan as quickly as possible.  At the end
of the year they can afford to pay 95K.  The business has been experiencing 11% revenue growth for the last 5 years with
projections showing that to continue.  Based on growth projections, they wish to increase loan payments by 10% per year.  We
wish to extend them the loan, and make 7%.
</p>
</div>
</div>

<div id="outline-container-orgedcde21" class="outline-2">
<h2 id="orgedcde21"><span class="section-number-2">3.</span> <code>loan_up_down_payments.f90</code></h2>
<div class="outline-text-2" id="text-3">
<p>
This program extends the examples from loan_level_payments.f90 and loan_geometric_payments.f90 to a unequal, non-standard
annuity designed to make payments round cent values.
</p>

<p>
One way to amortize a loan is to round all payments but the last one up to the nearest penny, and then adjust the last
payment lower to accommodate the difference &#x2013; this last payment is rounded DOWN to the nearest cent.  This insures that the
lender will not loose more than a fractional cent on the entire transaction, and the borrower don't pay more than the agreed
upon rate (this second condition is required by law in many jurisdictions).  Note this method is unsuitable for very long
term loans as it may shorten the overall term.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
</div>
</body>
</html>
